Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФизическиеЛица/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    ОбъектФормы = ЭтотОбъект.Объект; 
    Если Не ПустаяСтрока(ОбъектФормы.Фамилия) Тогда
        Результат = ОбъектФормы.Фамилия;
    КонецЕсли;
    
    Если Не ПустаяСтрока(ОбъектФормы.Имя) Тогда
        Результат = Результат + " " + Лев(ОбъектФормы.Имя, 1) + ".";
    КонецЕсли;
    
    Если Не ПустаяСтрока(ОбъектФормы.Отчество) Тогда
        Результат = Результат + Лев(ОбъектФормы.Отчество, 1) + ".";
    КонецЕсли;
    
    ОбъектФормы.Наименование = СокрЛП(Результат);
КонецПроцедуры
